app/views/articles/_form.html.erb

          <div class="col-10">
            <%= f.collection_select(:category_ids, Category.all, :id, :name,
            { prompt: "make your selection from the list below(can be empty)"}, { multiple: true, class: "form-select shadow rounded" , style: "height:70px"})%>
---
SELECT "categories".* FROM "categories"