app/views/users/_users.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---
                <td><%= link_to gravatar_for(user, size: 150), user%></td></h5>
              <p class="card-text"><%= pluralize(user.articles.count, "article") %></p>