app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 4)

    if params[:search_by_title]
      @articles = @articles.where("title like ?",
      "%# {params[:search_by_title]}%")
      if @articles.empty?

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "First user articles"], ["description", "first description articles"], ["created_at", "2022-01-29 10:24:42.756290"], ["updated_at", "2022-01-29 10:24:42.756290"], ["user_id", 1]]
---
  def create
    @article = Article.new(articles_params)
    @article.user = current_user
    if @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "First Articoll"], ["updated_at", "2022-01-29 10:24:21.745252"], ["id", 1]]
---
  def update
    if @article.update(articles_params)