app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?)  [["name", "SocialMedia"], ["created_at", "2022-01-30 12:28:22.196758"], ["updated_at", "2022-01-30 12:28:22.196758"], ["description", "Acest categori va contine doar articole despre social media"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save

SELECT "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"
---
  def index
    @categories = Category.paginate(page: params[:page], per_page: 4)

SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 2], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 2]]
---
  def show
    @articles = @category.articles.paginate(page: params[:page], per_page:5)

UPDATE "categories" SET "updated_at" = ?, "description" = ? WHERE "categories"."id" = ?  [["updated_at", "2022-01-30 09:38:56.350794"], ["description", "Acuma merge !!"], ["id", 2]]
---
  def update
    if @category.update(category_params)