app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "narco853@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:sessions][:email].downcase)