app/controllers/users_controller.rb

  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 4)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]

  def index
    @users = User.paginate(page: params[:page], per_page: 4)
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"