app/views/categories/index.html.erb

              <p class="card-text"><%= truncate(category.description, length: 100) %></p>
              <p class="card-text"><%= pluralize(category.articles.count, "article") %></p>
---
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 2]]